org/2016-06-20-chromiums-callback-bind-from-scratch.org
#+TITLE: Chromium's callback<>, bind<> from scratch
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-style.css" />
#+BEGIN_HTML
---
layout: page
title: Chromium's callback<>, bind<> from scratch
categories: c++ template chromium
tags: c++ template chromium callback bind
---
#+END_HTML

I've been working on chromium source for few years. I want to analyze how
~Callback<>~ works because it looks like a magic at least to me. 

Let's start with simple function ~void func()~

* Mission 1: Implement Callback for ~void func()~

  #+BEGIN_SRC c++
    void void_func() {
    }

    int main(int, char* []) {
      Callback<void()> cb = Bind(&void_func);
      cb.Run();
      return 0;
    }
  #+END_SRC

  #+BEGIN_SRC c++
    template <typename Sig>
    class Callback;

    template <typename R>
    class Callback<R()> {
     public:
      Callback(R (*functor)()) : functor_(functor) {}
      R Run() { return functor_(); }

     private:
      R (*functor_)();
    };

    template <typename R>
    Callback<R()> Bind(R (*functor)()) {
      return Callback<R()>(functor);
    }

    // ...
  #+END_SRC

  One thing worth to mention is declaring ~template <typename Sig>class
  Callback~.  ~Sig~ can be combination of any return type with any number of
  parameter type. For example, we can use ~Callback<void()>~,
  ~Callback<void(int)>~, ~Callback<void(Obj::*)(int, double)>~ with only one
  parameter type.  This trick is used very often for other template code, so we need
  to understand how to use this trick.

  If we compile this ~Callback<void()> cb = Bind(&void_func);~, In ~Bind~, type
  deduce ~[R = void]~.

* Mission 2: Support ~void(*)(int)~

  Let's support ~void int_func(int)~.

  #+BEGIN_SRC c++
    void int_func(int);

    Callback<void(int)> cb2 = Bind(&int_func);
    cb2.Run(1);
  #+END_SRC

  The most simple way of supporting this is overloading. We can create another
  Callback for ~void(*)(int)~.

  #+BEGIN_SRC c++
    template <typename R, typename P>
    class Callback<R(P)> {
     public:
      Callback(R (*functor)(P)) : functor_(functor) {}
      R Run(P p) { return functor_(p); }

     private:
      R (*functor_)(P);
    };

    template <typename R, typename P>
    Callback<R(P)> Bind(R (*functor)(P)) {
      return Callback<R(P)>(functor);
    }
  #+END_SRC
  
  Both in ~Bind~ and ~Callback~, type deduce ~[R = void, P = int]~.

* Mission 3: Support member method ~Bind(&Obj::void_func, &obj)~
