_posts/2016-06-20-chromiums-callback-bind-from-scratch.html
---
layout: page
title: Chromium's callback<>, bind<> from scratch
categories: c++ template chromium
tags: c++ template chromium callback bind
---

<p>
I've been working on chromium source for few years. I want to analyze how
<code>Callback&lt;&gt;</code> works because it looks like a magic at least to me. 
</p>

<p>
Let's start with simple function <code>void func()</code>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mission 1: Implement Callback for <code>void func()</code></h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b58900;">void</span> <span style="color: #268bd2;">void_func</span>() {
}

<span style="color: #b58900;">int</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">int</span>, <span style="color: #b58900;">char</span>* []) {
  <span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>()&gt; <span style="color: #268bd2;">cb</span> = Bind(&amp;void_func);
  cb.Run();
  <span style="color: #859900;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Sig</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>;

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt; {
 <span style="color: #859900;">public</span>:
  Callback(<span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor</span>)()) : functor_(functor) {}
  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>() { <span style="color: #859900;">return</span> functor_(); }

 <span style="color: #859900;">private</span>:
  <span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor_</span>)();
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R()&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor</span>)()) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt;(functor);
}

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
</pre>
</div>

<p>
One thing worth to mention is declaring <code>template &lt;typename Sig&gt;class
  Callback</code>.  <code>Sig</code> can be combination of any return type with any number of
parameter type. For example, we can use <code>Callback&lt;void()&gt;</code>,
<code>Callback&lt;void(int)&gt;</code>, <code>Callback&lt;void(Obj::*)(int, double)&gt;</code> with only one
parameter type.  This trick is used very often for other template code, so we need
to understand how to use this trick.
</p>

<p>
If we compile this <code>Callback&lt;void()&gt; cb = Bind(&amp;void_func);</code>, In <code>Bind</code>, type
deduce <code>[R = void]</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mission 2: Support <code>void(*)(int)</code></h2>
<div class="outline-text-2" id="text-2">
<p>
Let's support <code>void int_func(int)</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b58900;">void</span> <span style="color: #268bd2;">int_func</span>(<span style="color: #b58900;">int</span>);

<span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>(<span style="color: #b58900;">int</span>)&gt; <span style="color: #268bd2;">cb2</span> = Bind(&amp;int_func);
cb2.Run(1);
</pre>
</div>

<p>
The most simple way of supporting this is overloading. We can create another
Callback for <code>void(*)(int)</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R(<span style="color: #268bd2;">P</span>)&gt; {
 <span style="color: #859900;">public</span>:
  Callback(<span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor</span>)(<span style="color: #b58900;">P</span>)) : functor_(functor) {}
  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>(<span style="color: #b58900;">P</span> <span style="color: #268bd2;">p</span>) { <span style="color: #859900;">return</span> functor_(p); }

 <span style="color: #859900;">private</span>:
  <span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor_</span>)(<span style="color: #b58900;">P</span>);
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R(<span style="color: #268bd2;">P</span>)&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor</span>)(<span style="color: #b58900;">P</span>)) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;R(P)&gt;(functor);
}
</pre>
</div>

<p>
Both in <code>Bind</code> and <code>Callback</code>, type deduce <code>[R = void, P = int]</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Mission 3: Support member method <code>Bind(&amp;Obj::void_func, &amp;obj)</code></h2>
