org/2016-06-20-chromiums-callback-bind-from-scratch.org
** Overloading fail
  Support this.
  #+BEGIN_SRC c++
    struct Obj {
      void void_func() {}
    };

    Obj obj;
    Callback<void()> cb3 = Bind(&Obj::void_func, &obj);
    cb3.Run();
  #+END_SRC

  Since ~Bind~ binds both its method and instance of ~Obj~ (~Obj*~), we need to keep
  Obj* as well as its method. Let's call it ~RunnableAdapter~.

  Like we've done so far, let's overcome this by overloading.

  #+BEGIN_SRC c++
    template <typename R>
    class Callback<R()> {
      // ...
    };

    template <typename R, typename T>
    class Callback<R()> {
      // TODO: T cannot be a part of Callback<>'s type
    };

    template <typename R, typename T>
    Callback<R()> Bind(R (T::*functor)(), T* t) {
      return Callback<R()>(functor, t);
    }

    // Usage:
    {
      Callback<void()> cb = Bind(&void_func);
      cb.Run();

      Obj o;
      Callback<void()> cb3 = Bind(&Obj::void_func, &o);
      cb3.Run();
    }
  #+END_SRC

  We have problem. Because Binding ~void void_func()~ and ~Obj::void_func~ with ~Obj*~
  have same type ~Callback<void()>~, there is no way to put ~T~ in Callback's
  type. So, we need to find a way to fix this.

  In ~Callback<T>~, ~T~ means that actual ~RunType~. For example,
  ~Obj::void_func( void (Obj::*)() )~ need to be called with its
  instance(~Obj*~). After combining method and its instance, we'll get its
  ~RunType~ as ~void()~.

  #+BEGIN_SRC c++
    struct Obj {
      void void_func() {}
    };

    void Run(void (Obj::*functor)(), Obj* obj) {
      (obj->*functor)(); // RunType: void()
    }

    int main(int, char* []) {
      void (Obj::*functor)() = &Obj::void_func;
      Obj* obj = new Obj;
      Run(functor, obj);

      return 0;
    }

  #+END_SRC

  In this example, you maybe observe ~RunType~ (~void()~) of this inside of ~Run~. So, we
  need to do 2 things

  1. Add indirection between ~Bind~ and ~Callback<>~.
  2. ~Callback<>~ maybe store instance(~Obj*~) for method.

     Let's introduce ~RunnableAdapter<>~ and ~BindState<>~.
     - ~RunnableAdapter<>~ :: accepting normal function(~void (*)()~) or
          method(~void (T::*)()~) and provide ~Run~ method.
     - ~BindState<>~ :: storing method(~void (Obj::*)()~) with its instance(~Obj*~)

