_posts/2016-06-20-chromiums-callback-bind-from-scratch.html
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Overloading fail</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Support this.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">struct</span> <span style="color: #b58900;">Obj</span> {
  <span style="color: #b58900;">void</span> <span style="color: #268bd2;">void_func</span>() {}
};

<span style="color: #b58900;">Obj</span> <span style="color: #268bd2;">obj</span>;
<span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>()&gt; <span style="color: #268bd2;">cb3</span> = Bind(&amp;<span style="color: #2aa198;">Obj</span>::void_func, &amp;obj);
cb3.Run();
</pre>
</div>

<p>
Since <code>Bind</code> binds both its method and instance of <code>Obj</code> (<code>Obj*</code>), we need to keep
Obj* as well as its method. Let's call it <code>RunnableAdapter</code>.
</p>

<p>
Like we've done so far, let's overcome this by overloading.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt; {
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">T</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt; {
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">TODO: T cannot be a part of Callback&lt;&gt;'s type</span>
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">T</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R()&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor</span>)(), <span style="color: #b58900;">T</span>* <span style="color: #268bd2;">t</span>) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt;(functor, t);
}

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Usage:</span>
{
  <span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>()&gt; <span style="color: #268bd2;">cb</span> = Bind(&amp;void_func);
  cb.Run();

  <span style="color: #b58900;">Obj</span> <span style="color: #268bd2;">o</span>;
  <span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>()&gt; <span style="color: #268bd2;">cb3</span> = Bind(&amp;<span style="color: #2aa198;">Obj</span>::void_func, &amp;o);
  cb3.Run();
}
</pre>
</div>

<p>
We have problem. Because Binding <code>void void_func()</code> and <code>Obj::void_func</code> with <code>Obj*</code>
have same type <code>Callback&lt;void()&gt;</code>, there is no way to put <code>T</code> in Callback's
type. So, we need to find a way to fix this.
</p>

<p>
In <code>Callback&lt;T&gt;</code>, <code>T</code> means that actual <code>RunType</code>. For example,
<code>Obj::void_func( void (Obj::*)() )</code> need to be called with its
instance(<code>Obj*</code>). After combining method and its instance, we'll get its
<code>RunType</code> as <code>void()</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">struct</span> <span style="color: #b58900;">Obj</span> {
  <span style="color: #b58900;">void</span> <span style="color: #268bd2;">void_func</span>() {}
};

<span style="color: #b58900;">void</span> <span style="color: #268bd2;">Run</span>(<span style="color: #b58900;">void</span> (<span style="color: #2aa198;">Obj</span>::*<span style="color: #268bd2;">functor</span>)(), <span style="color: #b58900;">Obj</span>* <span style="color: #268bd2;">obj</span>) {
  (obj-&gt;*functor)(); <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">RunType: void()</span>
}

<span style="color: #b58900;">int</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">int</span>, <span style="color: #b58900;">char</span>* []) {
  <span style="color: #b58900;">void</span> (<span style="color: #2aa198;">Obj</span>::*<span style="color: #268bd2;">functor</span>)() = &amp;<span style="color: #2aa198;">Obj</span>::void_func;
  <span style="color: #b58900;">Obj</span>* <span style="color: #268bd2;">obj</span> = <span style="color: #859900;">new</span> <span style="color: #b58900;">Obj</span>;
  Run(functor, obj);

  <span style="color: #859900;">return</span> 0;
}
</pre>
</div>

<p>
In this example, you maybe observe <code>RunType</code> (<code>void()</code>) of this inside of <code>Run</code>. So, we
need to do 2 things
</p>

<ol class="org-ol">
<li>Add indirection between <code>Bind</code> and <code>Callback&lt;&gt;</code>.</li>
<li><p>
<code>Callback&lt;&gt;</code> maybe store instance(<code>Obj*</code>) for method.
</p>

<p>
Let's introduce <code>RunnableAdapter&lt;&gt;</code> and <code>BindState&lt;&gt;</code>.
</p>
<dl class="org-dl">
<dt><code>RunnableAdapter&lt;&gt;</code></dt><dd>accepting normal function(<code>void (*)()</code>) or
method(<code>void (T::*)()</code>) and provide <code>Run</code> method.</dd>
<dt><code>BindState&lt;&gt;</code></dt><dd>storing method(<code>void (Obj::*)()</code>) with its instance(<code>Obj*</code>)</dd>
</dl></li>
</ol>
</div>
</div>
