org/2016-06-20-chromiums-callback-bind-from-scratch.org
** ~RunnableAdapter<>~, ~BindState<>~ and ~Bind~ overhaul
   
   #+BEGIN_SRC c++
     template <typename Sig>
     class RunnableAdapter;

     template <typename R, typename T>
     class RunnableAdapter<R (T::*)()> {
      public:
       RunnableAdapter(R (T::*functor)()) : functor_(functor) {}

       R Run(T* t) { return (t->*functor_)(); }

      private:
       R (T::*functor_)();
     };

     template <typename Runnable, typename RunType, typename BoundArgsType>
     struct BindState;

     template <typename Runnable, typename RunType, typename P1>
     struct BindState<Runnable, RunType, void(P1)> {
       BindState(Runnable runnable, P1 p1) : runnable_(runnable), p1_(p1) {}

       Runnable runnable_;
       P1 p1_;
     };

     template <typename R, typename T>
     Callback<R()> Bind(R (T::*functor)(), T* t) {
       return Callback<R()>(new BindState<RunnableAdapter<R (T::*)()>, R(), R(T*)>(
           RunnableAdapter<R (T::*)()>(functor), t));
     }
   #+END_SRC

   ~RunnableAdapter<>~ encapsulates method(possibly normal function later) and
   ~BindState<>~ accepts ~RunnableAdapter<>~ and its instance, finally
   ~Callback<>~ accepts ~BindState<>~. Now it's time to implement
   ~Callback<R()>~.

   #+BEGIN_SRC c++
     // template <typename R>
     // class Callback<R()> {
     //  public:
     //   Callback(R (*functor)()) : functor_(functor) {}
     //   R Run() { return functor_(); }

     //  private:
     //   R (*functor_)();
     // };

     struct BindStateBase {};

     template <typename Runnable, typename RunType, typename P1>
     struct BindState<Runnable, RunType, void(P1)> : public BindStateBase {
       using UnboundType = RunType;
       BindState(Runnable runnable, P1 p1) : runnable_(runnable), p1_(p1) {}

       Runnable runnable_;
       P1 p1_;
     };

     template <typename R>
     class Callback<R()> {
      public:
       template <typename BindState>
       Callback(BindState* bind_state) : bind_state_(bind_state) {}

       R Run() {
         // TODO:
       }

      private:
       BindStateBase* bind_state_;
     };

     template <typename R, typename T>
     Callback<R()> Bind(R (T::*functor)(), T* t) {
       return Callback<R()>(new BindState<RunnableAdapter<R(T::*)()>, R(), R(T*)>(
           RunnableAdapter<R (T::*)()>(functor), t));
     }
   #+END_SRC

   At first, old ~Callback<R()>~ commented out. ~Callback<>~ now have *Function
   Template* as its constructor with its param type as ~BindStateBase~. This
   enables to accept different type of ~BindState<>~. 

   Let's implement ~Callback<>::Run()~ in the next phase.

