_posts/2016-06-20-chromiums-callback-bind-from-scratch.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <code>RunnableAdapter&lt;&gt;</code>, <code>BindState&lt;&gt;</code> and <code>Bind</code> overhaul</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Sig</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">RunnableAdapter</span>;

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">T</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">RunnableAdapter</span>&lt;<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*)()&gt; {
 <span style="color: #859900;">public</span>:
  RunnableAdapter(<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor</span>)()) : functor_(functor) {}

  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>(<span style="color: #b58900;">T</span>* <span style="color: #268bd2;">t</span>) { <span style="color: #859900;">return</span> (t-&gt;*functor_)(); }

 <span style="color: #859900;">private</span>:
  <span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor_</span>)();
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Runnable</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">RunType</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">BoundArgsType</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindState</span>;

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Runnable</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">RunType</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P1</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindState</span>&lt;<span style="color: #b58900;">Runnable</span>, <span style="color: #b58900;">RunType</span>, <span style="color: #b58900;">void</span>(<span style="color: #268bd2;">P1</span>)&gt; {
  <span style="color: #268bd2;">BindState</span>(<span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable</span>, <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1</span>) : runnable_(runnable), p1_(p1) {}

  <span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable_</span>;
  <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1_</span>;
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">T</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R()&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor</span>)(), <span style="color: #b58900;">T</span>* <span style="color: #268bd2;">t</span>) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt;(<span style="color: #859900;">new</span> <span style="color: #b58900;">BindState</span>&lt;<span style="color: #b58900;">RunnableAdapter</span>&lt;R (<span style="color: #2aa198;">T</span>::*)()&gt;, R(), R(<span style="color: #b58900;">T</span>*)&gt;(
      <span style="color: #b58900;">RunnableAdapter</span>&lt;<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*)()&gt;(<span style="color: #268bd2;">functor</span>), t));
}
</pre>
</div>

<p>
<code>RunnableAdapter&lt;&gt;</code> encapsulates method(possibly normal function later) and
<code>BindState&lt;&gt;</code> accepts <code>RunnableAdapter&lt;&gt;</code> and its instance, finally
<code>Callback&lt;&gt;</code> accepts <code>BindState&lt;&gt;</code>. Now it's time to implement
<code>Callback&lt;R()&gt;</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">template &lt;typename R&gt;</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">class Callback&lt;R()&gt; {</span>
<span style="color: #93a1a1; font-style: italic;">//  </span><span style="color: #93a1a1; font-style: italic;">public:</span>
<span style="color: #93a1a1; font-style: italic;">//   </span><span style="color: #93a1a1; font-style: italic;">Callback(R (*functor)()) : functor_(functor) {}</span>
<span style="color: #93a1a1; font-style: italic;">//   </span><span style="color: #93a1a1; font-style: italic;">R Run() { return functor_(); }</span>

<span style="color: #93a1a1; font-style: italic;">//  </span><span style="color: #93a1a1; font-style: italic;">private:</span>
<span style="color: #93a1a1; font-style: italic;">//   </span><span style="color: #93a1a1; font-style: italic;">R (*functor_)();</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">};</span>

<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindStateBase</span> {};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Runnable</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">RunType</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P1</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindState</span>&lt;<span style="color: #b58900;">Runnable</span>, <span style="color: #b58900;">RunType</span>, <span style="color: #b58900;">void</span>(<span style="color: #268bd2;">P1</span>)&gt; : <span style="color: #859900;">public</span> BindStateBase {
  <span style="color: #859900;">using</span> <span style="color: #b58900;">UnboundType</span> = RunType;
  <span style="color: #268bd2;">BindState</span>(<span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable</span>, <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1</span>) : runnable_(runnable), p1_(p1) {}

  <span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable_</span>;
  <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1_</span>;
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt; {
 <span style="color: #859900;">public</span>:
  <span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">BindState</span>&gt;
  <span style="color: #268bd2;">Callback</span>(<span style="color: #b58900;">BindState</span>* <span style="color: #268bd2;">bind_state</span>) : bind_state_(bind_state) {}

  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>() {
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">TODO:</span>
  }

 <span style="color: #859900;">private</span>:
  <span style="color: #b58900;">BindStateBase</span>* <span style="color: #268bd2;">bind_state_</span>;
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">T</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R()&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor</span>)(), <span style="color: #b58900;">T</span>* <span style="color: #268bd2;">t</span>) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt;(<span style="color: #859900;">new</span> <span style="color: #b58900;">BindState</span>&lt;<span style="color: #b58900;">RunnableAdapter</span>&lt;R(<span style="color: #2aa198;">T</span>::*)()&gt;, R(), R(<span style="color: #b58900;">T</span>*)&gt;(
      <span style="color: #b58900;">RunnableAdapter</span>&lt;<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*)()&gt;(<span style="color: #268bd2;">functor</span>), t));
}
</pre>
</div>

<p>
At first, old <code>Callback&lt;R()&gt;</code> commented out. <code>Callback&lt;&gt;</code> now have <b>Function
Template</b> as its constructor with its param type as <code>BindStateBase</code>. This
enables to accept different type of <code>BindState&lt;&gt;</code>. 
</p>

<p>
Let's implement <code>Callback&lt;&gt;::Run()</code> in the next phase.
</p>
</div>
</div>
