org/2016-06-20-chromiums-callback-bind-from-scratch.org
** ~Invoker<>~ (depends on ~BindState<>~) and ~Invoker<>::Run~ (static method)

   To implement ~R Run()~, it requires another trick. Since we have ~BindState<>~
   and ~RunnableAdapter<>~, we can call any functor in ~Callback<>~. But,
   ~Callback<>~ accept different type derived classes of ~BindStateBase~ and it
   requires different invoking syntax. In other words, invoking BindState
   depends on BindState. So, let's add ~Invoker<>~ type in ~BindState<>~.

   #+BEGIN_SRC c++
     template <typename Storage, typename R>
     struct Invoker<Storage, R()> {
       static R Run(BindStateBase* bind_state) {
         Storage* storage = static_cast<Storage*>(bind_state);
         return storage->runnable_.Run(storage->p1_);
       }
     };

     template <typename Runnable, typename RunType, typename P1>
     struct BindState<Runnable, RunType, void(P1)> : public BindStateBase {
       using UnboundType = RunType;
       using InvokerType = Invoker<BindState<Runnable, RunType, void(P1)>, RunType>;
       BindState(Runnable runnable, P1 p1) : runnable_(runnable), p1_(p1) {}

       Runnable runnable_;
       P1 p1_;
     };
   #+END_SRC

   ~Invoker<>~ has *static* method named ~Run()~ and it depends on
   ~BindState<>~. ~BindState<>::InvokerType~ will be used to run in
   ~Callback<>::Run()~.

** ~Callback<>~ constructor *Functor Template*

   #+BEGIN_SRC c++
     template <typename R>
     class Callback<R()> {
      public:
       template <typename BindState>
       Callback(BindState* bind_state) : bind_state_(bind_state) {
         polymorphic_invoke_ = &BindState::InvokerType::Run;
       }

       R Run() {
         return polymorphic_invoke_(bind_state_);
       }

      private:
       using PolymorphicInvoke = R(*)(BindStateBase*);

       PolymorphicInvoke polymorphic_invoke_;
       BindStateBase* bind_state_;
     };
   #+END_SRC

   Finally we've implemented ~Callback<>::Run()~. Please note that
   ~polymorphic_invoke_~ depends on ~BindState<>~ and know how to run functor
   from ~BindState<>~.

   One trivial thing in here is that call function that returns void with return
   statement. For example, this is valid though it looks weird.
   #+BEGIN_SRC c++
     void return_void() {}
     void func_void() { return return_void(); }
   #+END_SRC

   Let's test whether ~Obj::void_func()~ called.

   #+BEGIN_SRC c++
     #include <cassert>

     struct Obj {
       Obj() : called(false) {}
       ~Obj() { assert(called); }
       void void_func() { called = true; }
       bool called;
     };

     int main(int, char* []) {
       Obj o;
       Callback<void()> cb3 = Bind(&Obj::void_func, &o);
       cb3.Run();
     }
   #+END_SRC

   During stack unwind at the end of ~main()~, ~Obj::Obj() checks ~Obj::called~ is ~true~. No
   assertion found.

