_posts/2016-06-20-chromiums-callback-bind-from-scratch.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <code>Invoker&lt;&gt;</code> (depends on <code>BindState&lt;&gt;</code>) and <code>Invoker&lt;&gt;::Run</code> (static method)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
To implement <code>R Run()</code>, it requires another trick. Since we have <code>BindState&lt;&gt;</code>
and <code>RunnableAdapter&lt;&gt;</code>, we can call any functor in <code>Callback&lt;&gt;</code>. But,
<code>Callback&lt;&gt;</code> accept different type derived classes of <code>BindStateBase</code> and it
requires different invoking syntax. In other words, invoking BindState
depends on BindState. So, let's add <code>Invoker&lt;&gt;</code> type in <code>BindState&lt;&gt;</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Storage</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">Invoker</span>&lt;<span style="color: #b58900;">Storage</span>, R()&gt; {
  <span style="color: #859900;">static</span> <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>(<span style="color: #b58900;">BindStateBase</span>* <span style="color: #268bd2;">bind_state</span>) {
    <span style="color: #b58900;">Storage</span>* <span style="color: #268bd2;">storage</span> = <span style="color: #859900;">static_cast</span>&lt;Storage*&gt;(bind_state);
    <span style="color: #859900;">return</span> storage-&gt;runnable_.Run(storage-&gt;p1_);
  }
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Runnable</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">RunType</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P1</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindState</span>&lt;<span style="color: #b58900;">Runnable</span>, <span style="color: #b58900;">RunType</span>, <span style="color: #b58900;">void</span>(<span style="color: #268bd2;">P1</span>)&gt; : <span style="color: #859900;">public</span> BindStateBase {
  <span style="color: #859900;">using</span> <span style="color: #b58900;">UnboundType</span> = RunType;
  <span style="color: #859900;">using</span> <span style="color: #b58900;">InvokerType</span> = <span style="color: #b58900;">Invoker</span>&lt;<span style="color: #b58900;">BindState</span>&lt;Runnable, RunType, <span style="color: #b58900;">void</span>(P1)&gt;, RunType&gt;;
  <span style="color: #268bd2;">BindState</span>(<span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable</span>, <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1</span>) : runnable_(runnable), p1_(p1) {}

  <span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable_</span>;
  <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1_</span>;
};
</pre>
</div>

<p>
<code>Invoker&lt;&gt;</code> has <b>static</b> method named <code>Run()</code> and it depends on
<code>BindState&lt;&gt;</code>. <code>BindState&lt;&gt;::InvokerType</code> will be used to run in
<code>Callback&lt;&gt;::Run()</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <code>Callback&lt;&gt;</code> constructor <b>Functor Template</b></h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt; {
 <span style="color: #859900;">public</span>:
  <span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">BindState</span>&gt;
  <span style="color: #268bd2;">Callback</span>(<span style="color: #b58900;">BindState</span>* <span style="color: #268bd2;">bind_state</span>) : bind_state_(bind_state) {
    polymorphic_invoke_ = &amp;<span style="color: #2aa198;">BindState</span>::<span style="color: #2aa198;">InvokerType</span>::Run;
  }

  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>() {
    <span style="color: #859900;">return</span> polymorphic_invoke_(bind_state_);
  }

 <span style="color: #859900;">private</span>:
  <span style="color: #859900;">using</span> <span style="color: #b58900;">PolymorphicInvoke</span> = R(*)(<span style="color: #b58900;">BindStateBase</span>*);

  <span style="color: #b58900;">PolymorphicInvoke</span> <span style="color: #268bd2;">polymorphic_invoke_</span>;
  <span style="color: #b58900;">BindStateBase</span>* <span style="color: #268bd2;">bind_state_</span>;
};
</pre>
</div>

<p>
Finally we've implemented <code>Callback&lt;&gt;::Run()</code>. Please note that
<code>polymorphic_invoke_</code> depends on <code>BindState&lt;&gt;</code> and know how to run functor
from <code>BindState&lt;&gt;</code>.
</p>

<p>
One trivial thing in here is that call function that returns void with return
statement. For example, this is valid though it looks weird.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b58900;">void</span> <span style="color: #268bd2;">return_void</span>() {}
<span style="color: #b58900;">void</span> <span style="color: #268bd2;">func_void</span>() { <span style="color: #859900;">return</span> return_void(); }
</pre>
</div>

<p>
Let's test whether <code>Obj::void_func()</code> called.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">&lt;cassert&gt;</span>

<span style="color: #859900;">struct</span> <span style="color: #b58900;">Obj</span> {
  <span style="color: #268bd2;">Obj</span>() : called(<span style="color: #2aa198;">false</span>) {}
  ~<span style="color: #268bd2;">Obj</span>() { assert(called); }
  <span style="color: #b58900;">void</span> <span style="color: #268bd2;">void_func</span>() { called = <span style="color: #2aa198;">true</span>; }
  <span style="color: #b58900;">bool</span> <span style="color: #268bd2;">called</span>;
};

<span style="color: #b58900;">int</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">int</span>, <span style="color: #b58900;">char</span>* []) {
  <span style="color: #b58900;">Obj</span> <span style="color: #268bd2;">o</span>;
  <span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>()&gt; <span style="color: #268bd2;">cb3</span> = Bind(&amp;<span style="color: #2aa198;">Obj</span>::void_func, &amp;o);
  cb3.Run();
}
</pre>
</div>

<p>
During stack unwind at the end of <code>main()</code>, <code>Obj::Obj() checks ~Obj::called</code> is <code>true</code>. No
assertion found.
</p>
</div>
</div>
