org/2016-06-20-chromiums-callback-bind-from-scratch.org
** Whole source code

   #+BEGIN_SRC c++
     template <typename Sig>
     class Callback;

     template <typename R, typename P>
     class Callback<R(P)> {
      public:
       Callback(R (*functor)(P)) : functor_(functor) {}
       R Run(P p) { return functor_(p); }

      private:
       R (*functor_)(P);
     };

     // template <typename R>
     // class Callback<R()> {
     //  public:
     //   Callback(R (*functor)()) : functor_(functor) {}
     //   R Run() { return functor_(); }

     //  private:
     //   R (*functor_)();
     // };

     template <typename R, typename P>
     Callback<R(P)> Bind(R (*functor)(P)) {
       return Callback<R(P)>(functor);
     }

     template <typename R>
     Callback<R()> Bind(R (*functor)()) {
       return Callback<R()>(functor);
     }

     template <typename Sig>
     class RunnableAdapter;

     template <typename R, typename T>
     class RunnableAdapter<R (T::*)()> {
      public:
       RunnableAdapter(R (T::*functor)()) : functor_(functor) {}

       R Run(T* t) { return (t->*functor_)(); }

      private:
       R (T::*functor_)();
     };

     template <typename Runnable, typename RunType, typename BoundArgsType>
     struct BindState;

     struct BindStateBase {};

     template <typename Storage, typename RunType>
     struct Invoker;

     template <typename Storage, typename R>
     struct Invoker<Storage, R()> {
       static R Run(BindStateBase* bind_state) {
         Storage* storage = static_cast<Storage*>(bind_state);
         return storage->runnable_.Run(storage->p1_);
       }
     };

     template <typename Runnable, typename RunType, typename P1>
     struct BindState<Runnable, RunType, void(P1)> : public BindStateBase {
       using UnboundType = RunType;
       using InvokerType = Invoker<BindState<Runnable, RunType, void(P1)>, RunType>;
       BindState(Runnable runnable, P1 p1) : runnable_(runnable), p1_(p1) {}

       Runnable runnable_;
       P1 p1_;
     };

     template <typename R>
     class Callback<R()> {
      public:
       template <typename BindState>
       Callback(BindState* bind_state)
           : bind_state_(bind_state) {
         polymorphic_invoke_ = &BindState::InvokerType::Run;
       }

       R Run() { return polymorphic_invoke_(bind_state_); }

      private:
       using PolymorphicInvoke = R (*)(BindStateBase*);

       PolymorphicInvoke polymorphic_invoke_;
       BindStateBase* bind_state_;
     };

     template <typename R, typename T>
     Callback<R()> Bind(R (T::*functor)(), T* t) {
       return Callback<
           typename BindState<RunnableAdapter<R (T::*)()>, R(), R(T*)>::UnboundType>(
           new BindState<RunnableAdapter<R (T::*)()>, R(), R(T*)>(
               RunnableAdapter<R (T::*)()>(functor), t));
     }

     void void_func() {
     }
     void int_func(int) {
     }

     #include <cassert>

     struct Obj {
       Obj() : called(false) {}
       ~Obj() { assert(called); }
       void void_func() { called = true; }
       bool called;
     };

     int main(int, char* []) {
       // Callback<void()> cb = Bind(&void_func);
       // cb.Run();

       // Callback<void(int)> cb2 = Bind(&int_func);
       // cb2.Run(1);

       Obj o;
       Callback<void()> cb3 = Bind(&Obj::void_func, &o);
       cb3.Run();

       return 0;
     }
   #+END_SRC

