_posts/2016-06-20-chromiums-callback-bind-from-scratch.html

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Whole source code</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Sig</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>;

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R(<span style="color: #268bd2;">P</span>)&gt; {
 <span style="color: #859900;">public</span>:
  Callback(<span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor</span>)(<span style="color: #b58900;">P</span>)) : functor_(functor) {}
  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>(<span style="color: #b58900;">P</span> <span style="color: #268bd2;">p</span>) { <span style="color: #859900;">return</span> functor_(p); }

 <span style="color: #859900;">private</span>:
  <span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor_</span>)(<span style="color: #b58900;">P</span>);
};

<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">template &lt;typename R&gt;</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">class Callback&lt;R()&gt; {</span>
<span style="color: #93a1a1; font-style: italic;">//  </span><span style="color: #93a1a1; font-style: italic;">public:</span>
<span style="color: #93a1a1; font-style: italic;">//   </span><span style="color: #93a1a1; font-style: italic;">Callback(R (*functor)()) : functor_(functor) {}</span>
<span style="color: #93a1a1; font-style: italic;">//   </span><span style="color: #93a1a1; font-style: italic;">R Run() { return functor_(); }</span>

<span style="color: #93a1a1; font-style: italic;">//  </span><span style="color: #93a1a1; font-style: italic;">private:</span>
<span style="color: #93a1a1; font-style: italic;">//   </span><span style="color: #93a1a1; font-style: italic;">R (*functor_)();</span>
<span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">};</span>

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R(<span style="color: #268bd2;">P</span>)&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor</span>)(<span style="color: #b58900;">P</span>)) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;R(P)&gt;(functor);
}

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R()&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (*<span style="color: #268bd2;">functor</span>)()) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt;(functor);
}

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Sig</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">RunnableAdapter</span>;

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">T</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">RunnableAdapter</span>&lt;<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*)()&gt; {
 <span style="color: #859900;">public</span>:
  RunnableAdapter(<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor</span>)()) : functor_(functor) {}

  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>(<span style="color: #b58900;">T</span>* <span style="color: #268bd2;">t</span>) { <span style="color: #859900;">return</span> (t-&gt;*functor_)(); }

 <span style="color: #859900;">private</span>:
  <span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor_</span>)();
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Runnable</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">RunType</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">BoundArgsType</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindState</span>;

<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindStateBase</span> {};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Storage</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">RunType</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">Invoker</span>;

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Storage</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">Invoker</span>&lt;<span style="color: #b58900;">Storage</span>, R()&gt; {
  <span style="color: #859900;">static</span> <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>(<span style="color: #b58900;">BindStateBase</span>* <span style="color: #268bd2;">bind_state</span>) {
    <span style="color: #b58900;">Storage</span>* <span style="color: #268bd2;">storage</span> = <span style="color: #859900;">static_cast</span>&lt;Storage*&gt;(bind_state);
    <span style="color: #859900;">return</span> storage-&gt;runnable_.Run(storage-&gt;p1_);
  }
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Runnable</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">RunType</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">P1</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">BindState</span>&lt;<span style="color: #b58900;">Runnable</span>, <span style="color: #b58900;">RunType</span>, <span style="color: #b58900;">void</span>(<span style="color: #268bd2;">P1</span>)&gt; : <span style="color: #859900;">public</span> BindStateBase {
  <span style="color: #859900;">using</span> <span style="color: #b58900;">UnboundType</span> = RunType;
  <span style="color: #859900;">using</span> <span style="color: #b58900;">InvokerType</span> = <span style="color: #b58900;">Invoker</span>&lt;<span style="color: #b58900;">BindState</span>&lt;Runnable, RunType, <span style="color: #b58900;">void</span>(P1)&gt;, RunType&gt;;
  <span style="color: #268bd2;">BindState</span>(<span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable</span>, <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1</span>) : runnable_(runnable), p1_(p1) {}

  <span style="color: #b58900;">Runnable</span> <span style="color: #268bd2;">runnable_</span>;
  <span style="color: #b58900;">P1</span> <span style="color: #268bd2;">p1_</span>;
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">class</span> <span style="color: #b58900;">Callback</span>&lt;R()&gt; {
 <span style="color: #859900;">public</span>:
  <span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">BindState</span>&gt;
  <span style="color: #268bd2;">Callback</span>(<span style="color: #b58900;">BindState</span>* <span style="color: #268bd2;">bind_state</span>)
      : bind_state_(bind_state) {
    polymorphic_invoke_ = &amp;<span style="color: #2aa198;">BindState</span>::<span style="color: #2aa198;">InvokerType</span>::Run;
  }

  <span style="color: #b58900;">R</span> <span style="color: #268bd2;">Run</span>() { <span style="color: #859900;">return</span> polymorphic_invoke_(bind_state_); }

 <span style="color: #859900;">private</span>:
  <span style="color: #859900;">using</span> <span style="color: #b58900;">PolymorphicInvoke</span> = R (*)(<span style="color: #b58900;">BindStateBase</span>*);

  <span style="color: #b58900;">PolymorphicInvoke</span> <span style="color: #268bd2;">polymorphic_invoke_</span>;
  <span style="color: #b58900;">BindStateBase</span>* <span style="color: #268bd2;">bind_state_</span>;
};

<span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">T</span>&gt;
<span style="color: #b58900;">Callback</span>&lt;R()&gt; <span style="color: #268bd2;">Bind</span>(<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*<span style="color: #268bd2;">functor</span>)(), <span style="color: #b58900;">T</span>* <span style="color: #268bd2;">t</span>) {
  <span style="color: #859900;">return</span> <span style="color: #b58900;">Callback</span>&lt;
      <span style="color: #859900;">typename</span> <span style="color: #2aa198;">BindState</span>&lt;<span style="color: #b58900;">RunnableAdapter</span>&lt;R (<span style="color: #2aa198;">T</span>::*)()&gt;, R(), R(<span style="color: #b58900;">T</span>*)&gt;::<span style="color: #b58900;">UnboundType</span>&gt;(
      <span style="color: #859900;">new</span> <span style="color: #b58900;">BindState</span>&lt;<span style="color: #b58900;">RunnableAdapter</span>&lt;R (<span style="color: #2aa198;">T</span>::*)()&gt;, R(), R(<span style="color: #b58900;">T</span>*)&gt;(
          <span style="color: #b58900;">RunnableAdapter</span>&lt;<span style="color: #b58900;">R</span> (<span style="color: #2aa198;">T</span>::*)()&gt;(<span style="color: #268bd2;">functor</span>), t));
}

<span style="color: #b58900;">void</span> <span style="color: #268bd2;">void_func</span>() {
}
<span style="color: #b58900;">void</span> <span style="color: #268bd2;">int_func</span>(<span style="color: #b58900;">int</span>) {
}

<span style="color: #cb4b16;">#include</span> <span style="color: #2aa198;">&lt;cassert&gt;</span>

<span style="color: #859900;">struct</span> <span style="color: #b58900;">Obj</span> {
  <span style="color: #268bd2;">Obj</span>() : called(<span style="color: #2aa198;">false</span>) {}
  ~<span style="color: #268bd2;">Obj</span>() { assert(called); }
  <span style="color: #b58900;">void</span> <span style="color: #268bd2;">void_func</span>() { called = <span style="color: #2aa198;">true</span>; }
  <span style="color: #b58900;">bool</span> <span style="color: #268bd2;">called</span>;
};

<span style="color: #b58900;">int</span> <span style="color: #268bd2;">main</span>(<span style="color: #b58900;">int</span>, <span style="color: #b58900;">char</span>* []) {
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Callback&lt;void()&gt; cb = Bind(&amp;void_func);</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">cb.Run();</span>

  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">Callback&lt;void(int)&gt; cb2 = Bind(&amp;int_func);</span>
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">cb2.Run(1);</span>

  <span style="color: #b58900;">Obj</span> <span style="color: #268bd2;">o</span>;
  <span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>()&gt; <span style="color: #268bd2;">cb3</span> = Bind(&amp;<span style="color: #2aa198;">Obj</span>::void_func, &amp;o);
  cb3.Run();

  <span style="color: #859900;">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>
