org/2016-06-20-chromiums-callback-bind-from-scratch.org
* Mission 4: Bring back void(*)()

  It was commented out while completing mission 3. So, it's time to bring it
  back.

  Add ~RunnableAdapter<R(*)()>~, ~Invoker<>~, ~BindState<,,void()>~ and
  ~Bind(R(*)())~ to support ~void(*)()~. But, we have problem in ~Invoker<>~,
  they have same signature, so we have 2 options to fix this.

  #+BEGIN_SRC c++
    template <typename Storage, typename R>
    struct Invoker<Storage, R()> {
      // ...
    }
  #+END_SRC

  1. Replace ~typename Storage~ with ~BindState<,,>~, ~BindState<>~ for each
     type are definitely different, so it fix this problem, but very long
     verbose typename is not readable.
  2. Introduce integer type representing number of bound types. I think this is
     also good to implement currying(See callback.h) in the future.

  #+BEGIN_SRC diff
    +template <typename R>
    +class RunnableAdapter<R(*)()> {
    + public:
    +  RunnableAdapter(R(*functor)()) : functor_(functor){}
    +
    +  R Run() {
    +    return (*functor_)();
    +  }
    +
    + private:
    +  R (*functor_)();
    +};

    -template <typename Storage, typename RunType>
    +template <int NumBound, typename Storage, typename RunType>
     struct Invoker;

     template <typename Storage, typename R>
    -struct Invoker<Storage, R()> {
    +struct Invoker<1, Storage, R()> {
       static R Run(BindStateBase* bind_state) {
         Storage* storage = static_cast<Storage*>(bind_state);
         return storage->runnable_.Run(storage->p1_);
       }
     };

    +template <typename Storage, typename R>
    +struct Invoker<0, Storage, R()> {
    +  static R Run(BindStateBase* bind_state) {
    +    Storage* storage = static_cast<Storage*>(bind_state);
    +    return storage->runnable_.Run();
    +  }
    +};

     template <typename Runnable, typename RunType, typename P1>
     struct BindState<Runnable, RunType, void(P1)> : public BindStateBase {
       using UnboundType = RunType;
    -  using InvokerType = Invoker<BindState<Runnable, RunType, void(P1)>, RunType>;
    +  using InvokerType = Invoker<1, BindState<Runnable, RunType, void(P1)>, RunType>;
       BindState(Runnable runnable, P1 p1) : runnable_(runnable), p1_(p1) {}

       Runnable runnable_;
       P1 p1_;
     };

    +template <typename Runnable, typename RunType>
    +struct BindState<Runnable, RunType, void()> : public BindStateBase {
    +  using UnboundType = RunType;
    +  using InvokerType = Invoker<0, BindState<Runnable, RunType, void()>, RunType>;
    +  BindState(Runnable runnable) : runnable_(runnable) {}
    +
    +  Runnable runnable_;
    +};

    +template <typename R>
    +Callback<R()> Bind(R (*functor)()) {
    +  return Callback<
    +      typename BindState<RunnableAdapter<R (*)()>, R(), R()>::UnboundType>(
    +      new BindState<RunnableAdapter<R (*)()>, R(), R()>(
    +          RunnableAdapter<R (*)()>(functor)));
    +}
    +

     int main(int, char* []) {
    -  // Callback<void()> cb = Bind(&void_func);
    -  // cb.Run();
    +  Callback<void()> cb = Bind(&void_func);
    +  cb.Run();

  #+END_SRC

  This is very easy and straightforward.

