_posts/2016-06-20-chromiums-callback-bind-from-scratch.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Mission 4: Bring back void(*)()</h2>
<div class="outline-text-2" id="text-4">
<p>
It was commented out while completing mission 3. So, it's time to bring it
back.
</p>

<p>
Add <code>RunnableAdapter&lt;R(*)()&gt;</code>, <code>Invoker&lt;&gt;</code>, <code>BindState&lt;,,void()&gt;</code> and
<code>Bind(R(*)())</code> to support <code>void(*)()</code>. But, we have problem in <code>Invoker&lt;&gt;</code>,
they have same signature, so we have 2 options to fix this.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span> <span style="color: #b58900;">Storage</span>, <span style="color: #859900;">typename</span> <span style="color: #b58900;">R</span>&gt;
<span style="color: #859900;">struct</span> <span style="color: #b58900;">Invoker</span>&lt;<span style="color: #b58900;">Storage</span>, R()&gt; {
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">...</span>
}
</pre>
</div>

<ol class="org-ol">
<li>Replace <code>typename Storage</code> with <code>BindState&lt;,,&gt;</code>, <code>BindState&lt;&gt;</code> for each
type are definitely different, so it fix this problem, but very long
verbose typename is not readable.</li>
<li>Introduce integer type representing number of bound types. I think this is
also good to implement currying(See callback.h) in the future.</li>
</ol>

<div class="org-src-container">

<pre class="src src-diff"><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename R&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">class RunnableAdapter&lt;R(*)()&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> public:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  RunnableAdapter(R(*functor)()) : functor_(functor){}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  R Run() {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    return (*functor_)();</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> private:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  R (*functor_)();</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>

<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">template &lt;typename Storage, typename RunType&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;int NumBound, typename Storage, typename RunType&gt;</span>
<span style="color: #93a1a1;"> struct Invoker;</span>

<span style="color: #93a1a1;"> template &lt;typename Storage, typename R&gt;</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">struct Invoker&lt;Storage, R()&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">struct Invoker&lt;1, Storage, R()&gt; {</span>
<span style="color: #93a1a1;">   static R Run(BindStateBase* bind_state) {</span>
<span style="color: #93a1a1;">     Storage* storage = static_cast&lt;Storage*&gt;(bind_state);</span>
<span style="color: #93a1a1;">     return storage-&gt;runnable_.Run(storage-&gt;p1_);</span>
<span style="color: #93a1a1;">   }</span>
<span style="color: #93a1a1;"> };</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename Storage, typename R&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">struct Invoker&lt;0, Storage, R()&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  static R Run(BindStateBase* bind_state) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    Storage* storage = static_cast&lt;Storage*&gt;(bind_state);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    return storage-&gt;runnable_.Run();</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>

<span style="color: #93a1a1;"> template &lt;typename Runnable, typename RunType, typename P1&gt;</span>
<span style="color: #93a1a1;"> struct BindState&lt;Runnable, RunType, void(P1)&gt; : public BindStateBase {</span>
<span style="color: #93a1a1;">   using UnboundType = RunType;</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  using InvokerType = Invoker&lt;BindState&lt;Runnable, RunType, void(P1)&gt;, RunType&gt;;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  using InvokerType = Invoker&lt;1, BindState&lt;Runnable, RunType, void(P1)&gt;, RunType&gt;;</span>
<span style="color: #93a1a1;">   BindState(Runnable runnable, P1 p1) : runnable_(runnable), p1_(p1) {}</span>

<span style="color: #93a1a1;">   Runnable runnable_;</span>
<span style="color: #93a1a1;">   P1 p1_;</span>
<span style="color: #93a1a1;"> };</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename Runnable, typename RunType&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">struct BindState&lt;Runnable, RunType, void()&gt; : public BindStateBase {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  using UnboundType = RunType;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  using InvokerType = Invoker&lt;0, BindState&lt;Runnable, RunType, void()&gt;, RunType&gt;;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  BindState(Runnable runnable) : runnable_(runnable) {}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  Runnable runnable_;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename R&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">Callback&lt;R()&gt; Bind(R (*functor)()) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  return Callback&lt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">      typename BindState&lt;RunnableAdapter&lt;R (*)()&gt;, R(), R()&gt;::UnboundType&gt;(</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">      new BindState&lt;RunnableAdapter&lt;R (*)()&gt;, R(), R()&gt;(</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">          RunnableAdapter&lt;R (*)()&gt;(functor)));</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>

<span style="color: #93a1a1;"> int main(int, char* []) {</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  // Callback&lt;void()&gt; cb = Bind(&amp;void_func);</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  // cb.Run();</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  Callback&lt;void()&gt; cb = Bind(&amp;void_func);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  cb.Run();</span>
</pre>
</div>

<p>
This is very easy and straightforward.
</p>
</div>
</div>
