org/2016-06-20-chromiums-callback-bind-from-scratch.org
* Mission 5: Bring back void(*)(int)

  There is nothing special but just fill the blank.

  #+BEGIN_SRC diff
     template <typename Sig>
     class Callback;
 
    -template <typename R, typename P>
    -class Callback<R(P)> {
    - public:
    -  Callback(R (*functor)(P)) : functor_(functor) {}
    -  R Run(P p) { return functor_(p); }
    -
    - private:
    -  R (*functor_)(P);
    -};
    -
    -template <typename R, typename P>
    -Callback<R(P)> Bind(R (*functor)(P)) {
    -  return Callback<R(P)>(functor);
    -}
    -
     template <typename Sig>
     class RunnableAdapter;
 
    @@ -33,6 +18,19 @@ class RunnableAdapter<R(*)()> {
       R (*functor_)();
     };
 
    +template <typename R, typename P>
    +class RunnableAdapter<R(*)(P)> {
    + public:
    +  RunnableAdapter(R(*functor)(P)) : functor_(functor){}
    +
    +  R Run(P p) {
    +    return (*functor_)(p);
    +  }
    +
    + private:
    +  R (*functor_)(P);
    +};
    +
     template <typename R, typename T>
     class RunnableAdapter<R(T::*)()> {
      public:
    @@ -70,6 +68,14 @@ struct Invoker<0, Storage, R()> {
       }
     };
 
    +template <typename Storage, typename R, typename P>
    +struct Invoker<0, Storage, R(P)> {
    +  static R Run(BindStateBase* bind_state, P p) {
    +    Storage* storage = static_cast<Storage*>(bind_state);
    +    return storage->runnable_.Run(p);
    +  }
    +};
    +
     template <typename Runnable, typename RunType, typename P1>
     struct BindState<Runnable, RunType, void(P1)> : public BindStateBase {
       using UnboundType = RunType;
    @@ -108,6 +114,25 @@ class Callback<R()> {
       BindStateBase* bind_state_;
     };
 
    +template <typename R, typename P>
    +class Callback<R(P)> {
    + public:
    +  template <typename BindState>
    +  Callback(BindState* bind_state) : bind_state_(bind_state) {
    +    polymorphic_invoke_ = &BindState::InvokerType::Run;
    +  }
    +
    +  R Run(P p) {
    +    return polymorphic_invoke_(bind_state_, p);
    +  }
    +
    + private:
    +  using PolymorphicInvoke = R(*)(BindStateBase*, P);
    +
    +  PolymorphicInvoke polymorphic_invoke_;
    +  BindStateBase* bind_state_;
    +};
    +
     template <typename R>
     Callback<R()> Bind(R (*functor)()) {
       return Callback<
    @@ -116,6 +141,14 @@ Callback<R()> Bind(R (*functor)()) {
               RunnableAdapter<R (*)()>(functor)));
     }
 
    +template <typename R, typename P>
    +Callback<R(P)> Bind(R (*functor)(P)) {
    +  return Callback<
    +      typename BindState<RunnableAdapter<R (*)(P)>, R(P), R()>::UnboundType>(
    +      new BindState<RunnableAdapter<R (*)(P)>, R(P), R()>(
    +          RunnableAdapter<R (*)(P)>(functor)));
    +}
    +
     template <typename R, typename T>
     Callback<R()> Bind(R (T::*functor)(), T* t) {
       return Callback<
    @@ -142,8 +175,8 @@ int main(int, char* []) {
       Callback<void()> cb = Bind(&void_func);
       cb.Run();
 
    -  // Callback<void(int)> cb2 = Bind(&int_func);
    -  // cb2.Run(1);
    +  Callback<void(int)> cb2 = Bind(&int_func);
    +  cb2.Run(1);
 
       Obj o;
       Callback<void()> cb3 = Bind(&Obj::void_func, &o);
  #+END_SRC

