_posts/2016-06-20-chromiums-callback-bind-from-scratch.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Mission 5: Bring back void(*)(int)</h2>
<div class="outline-text-2" id="text-5">
<p>
There is nothing special but just fill the blank.
</p>

<div class="org-src-container">

<pre class="src src-diff"><span style="color: #93a1a1;"> template &lt;typename Sig&gt;</span>
<span style="color: #93a1a1;"> class Callback;</span>

<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">template &lt;typename R, typename P&gt;</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">class Callback&lt;R(P)&gt; {</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;"> public:</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  Callback(R (*functor)(P)) : functor_(functor) {}</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  R Run(P p) { return functor_(p); }</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;"> private:</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  R (*functor_)(P);</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">};</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">template &lt;typename R, typename P&gt;</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">Callback&lt;R(P)&gt; Bind(R (*functor)(P)) {</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  return Callback&lt;R(P)&gt;(functor);</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">}</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span>
<span style="color: #93a1a1;"> template &lt;typename Sig&gt;</span>
<span style="color: #93a1a1;"> class RunnableAdapter;</span>

<span style="color: #586e75; background-color: #fdf6e3;">@@ -33,6 +18,19 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> class RunnableAdapter&lt;R(*)()&gt; {</span>
<span style="color: #93a1a1;">   R (*functor_)();</span>
<span style="color: #93a1a1;"> };</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename R, typename P&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">class RunnableAdapter&lt;R(*)(P)&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> public:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  RunnableAdapter(R(*functor)(P)) : functor_(functor){}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  R Run(P p) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    return (*functor_)(p);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> private:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  R (*functor_)(P);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> template &lt;typename R, typename T&gt;</span>
<span style="color: #93a1a1;"> class RunnableAdapter&lt;R(T::*)()&gt; {</span>
<span style="color: #93a1a1;">  public:</span>
<span style="color: #586e75; background-color: #fdf6e3;">@@ -70,6 +68,14 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> struct Invoker&lt;0, Storage, R()&gt; {</span>
<span style="color: #93a1a1;">   }</span>
<span style="color: #93a1a1;"> };</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename Storage, typename R, typename P&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">struct Invoker&lt;0, Storage, R(P)&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  static R Run(BindStateBase* bind_state, P p) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    Storage* storage = static_cast&lt;Storage*&gt;(bind_state);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    return storage-&gt;runnable_.Run(p);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> template &lt;typename Runnable, typename RunType, typename P1&gt;</span>
<span style="color: #93a1a1;"> struct BindState&lt;Runnable, RunType, void(P1)&gt; : public BindStateBase {</span>
<span style="color: #93a1a1;">   using UnboundType = RunType;</span>
<span style="color: #586e75; background-color: #fdf6e3;">@@ -108,6 +114,25 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> class Callback&lt;R()&gt; {</span>
<span style="color: #93a1a1;">   BindStateBase* bind_state_;</span>
<span style="color: #93a1a1;"> };</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename R, typename P&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">class Callback&lt;R(P)&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> public:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  template &lt;typename BindState&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  Callback(BindState* bind_state) : bind_state_(bind_state) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    polymorphic_invoke_ = &amp;BindState::InvokerType::Run;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  R Run(P p) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    return polymorphic_invoke_(bind_state_, p);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> private:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  using PolymorphicInvoke = R(*)(BindStateBase*, P);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  PolymorphicInvoke polymorphic_invoke_;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  BindStateBase* bind_state_;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> template &lt;typename R&gt;</span>
<span style="color: #93a1a1;"> Callback&lt;R()&gt; Bind(R (*functor)()) {</span>
<span style="color: #93a1a1;">   return Callback&lt;</span>
<span style="color: #586e75; background-color: #fdf6e3;">@@ -116,6 +141,14 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> Callback&lt;R()&gt; Bind(R (*functor)()) {</span>
<span style="color: #93a1a1;">           RunnableAdapter&lt;R (*)()&gt;(functor)));</span>
<span style="color: #93a1a1;"> }</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename R, typename P&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">Callback&lt;R(P)&gt; Bind(R (*functor)(P)) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  return Callback&lt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">      typename BindState&lt;RunnableAdapter&lt;R (*)(P)&gt;, R(P), R()&gt;::UnboundType&gt;(</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">      new BindState&lt;RunnableAdapter&lt;R (*)(P)&gt;, R(P), R()&gt;(</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">          RunnableAdapter&lt;R (*)(P)&gt;(functor)));</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> template &lt;typename R, typename T&gt;</span>
<span style="color: #93a1a1;"> Callback&lt;R()&gt; Bind(R (T::*functor)(), T* t) {</span>
<span style="color: #93a1a1;">   return Callback&lt;</span>
<span style="color: #586e75; background-color: #fdf6e3;">@@ -142,8 +175,8 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> int main(int, char* []) {</span>
<span style="color: #93a1a1;">   Callback&lt;void()&gt; cb = Bind(&amp;void_func);</span>
<span style="color: #93a1a1;">   cb.Run();</span>

<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  // Callback&lt;void(int)&gt; cb2 = Bind(&amp;int_func);</span>
<span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">-</span><span style="color: #dc322f; background-color: #eee8d5; font-weight: bold;">  // cb2.Run(1);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  Callback&lt;void(int)&gt; cb2 = Bind(&amp;int_func);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  cb2.Run(1);</span>

<span style="color: #93a1a1;">   Obj o;</span>
<span style="color: #93a1a1;">   Callback&lt;void()&gt; cb3 = Bind(&amp;Obj::void_func, &amp;o);</span>
</pre>
</div>
</div>
</div>
