org/2016-06-20-chromiums-callback-bind-from-scratch.org
* Mission 6: Support member method ~Bind(&Foo::int_func, &foo)~

  I know you feel tired, but I have to support member method accepting ~int~.

  #+BEGIN_SRC c++
    struct Foo {
      void int_func(int) {}
    };

    Foo foo;
    Callback<void(int)> cb4 = Bind(&Foo::int_func, &foo);
    cb4.Run(1);
  #+END_SRC

  As you may expect, it's very easy.

  #+BEGIN_SRC diff
    +template <typename R, typename T, typename P>
    +class RunnableAdapter<R(T::*)(P)> {
    + public:
    +  RunnableAdapter(R(T::*functor)(P)) : functor_(functor){}
    +
    +  R Run(T* t, P p) {
    +    return (t->*functor_)(p);
    +  }
    +
    + private:
    +  R (T::*functor_)(P);
    +};
    +
     template <typename Runnable, typename RunType, typename BoundArgsType>
     struct BindState;
 
    @@ -60,6 +73,14 @@ struct Invoker<1, Storage, R()> {
       }
     };
 
    +template <typename Storage, typename R, typename P2>
    +struct Invoker<1, Storage, R(P2)> {
    +  static R Run(BindStateBase* bind_state, P2 p2) {
    +    Storage* storage = static_cast<Storage*>(bind_state);
    +    return storage->runnable_.Run(storage->p1_, p2);
    +  }
    +};
    +
     template <typename Storage, typename R>
     struct Invoker<0, Storage, R()> {
       static R Run(BindStateBase* bind_state) {
    @@ -157,6 +178,14 @@ Callback<R()> Bind(R (T::*functor)(), T* t) {
               RunnableAdapter<R (T::*)()>(functor), t));
     }
 
    +template <typename R, typename T, typename P>
    +Callback<R(P)> Bind(R (T::*functor)(P), T* t) {
    +  return Callback<
    +      typename BindState<RunnableAdapter<R (T::*)(P)>, R(P), R(T*)>::UnboundType>(
    +      new BindState<RunnableAdapter<R (T::*)(P)>, R(P), R(T*)>(
    +          RunnableAdapter<R (T::*)(P)>(functor), t));
    +}
    +
     bool called;
 
     void void_func() {
    @@ -175,6 +204,13 @@ struct Obj {
       bool called;
     };
 
    +struct Foo {
    +  Foo() : called(false) {}
    +  ~Foo() { assert(called); }
    +  void int_func(int) { called = true; }
    +  bool called;
    +};
    +
     int main(int, char* []) {
       called = false;
       Callback<void()> cb = Bind(&void_func);
    @@ -190,5 +226,8 @@ int main(int, char* []) {
       Callback<void()> cb3 = Bind(&Obj::void_func, &o);
       cb3.Run();
 
    +  Foo foo;
    +  Callback<void(int)> cb4 = Bind(&Foo::int_func, &foo);
    +  cb4.Run(1);
       return 0;
     }
  #+END_SRC
