_posts/2016-06-20-chromiums-callback-bind-from-scratch.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Mission 6: Support member method <code>Bind(&amp;Foo::int_func, &amp;foo)</code></h2>
<div class="outline-text-2" id="text-6">
<p>
I know you feel tired, but I have to support member method accepting <code>int</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">struct</span> <span style="color: #b58900;">Foo</span> {
  <span style="color: #b58900;">void</span> <span style="color: #268bd2;">int_func</span>(<span style="color: #b58900;">int</span>) {}
};

<span style="color: #b58900;">Foo</span> <span style="color: #268bd2;">foo</span>;
<span style="color: #b58900;">Callback</span>&lt;<span style="color: #b58900;">void</span>(<span style="color: #b58900;">int</span>)&gt; <span style="color: #268bd2;">cb4</span> = Bind(&amp;<span style="color: #2aa198;">Foo</span>::int_func, &amp;foo);
cb4.Run(1);
</pre>
</div>

<p>
As you may expect, it's very easy.
</p>

<div class="org-src-container">

<pre class="src src-diff"><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename R, typename T, typename P&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">class RunnableAdapter&lt;R(T::*)(P)&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> public:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  RunnableAdapter(R(T::*functor)(P)) : functor_(functor){}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  R Run(T* t, P p) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    return (t-&gt;*functor_)(p);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;"> private:</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  R (T::*functor_)(P);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> template &lt;typename Runnable, typename RunType, typename BoundArgsType&gt;</span>
<span style="color: #93a1a1;"> struct BindState;</span>

<span style="color: #586e75; background-color: #fdf6e3;">@@ -60,6 +73,14 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> struct Invoker&lt;1, Storage, R()&gt; {</span>
<span style="color: #93a1a1;">   }</span>
<span style="color: #93a1a1;"> };</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename Storage, typename R, typename P2&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">struct Invoker&lt;1, Storage, R(P2)&gt; {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  static R Run(BindStateBase* bind_state, P2 p2) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    Storage* storage = static_cast&lt;Storage*&gt;(bind_state);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">    return storage-&gt;runnable_.Run(storage-&gt;p1_, p2);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> template &lt;typename Storage, typename R&gt;</span>
<span style="color: #93a1a1;"> struct Invoker&lt;0, Storage, R()&gt; {</span>
<span style="color: #93a1a1;">   static R Run(BindStateBase* bind_state) {</span>
<span style="color: #586e75; background-color: #fdf6e3;">@@ -157,6 +178,14 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> Callback&lt;R()&gt; Bind(R (T::*functor)(), T* t) {</span>
<span style="color: #93a1a1;">           RunnableAdapter&lt;R (T::*)()&gt;(functor), t));</span>
<span style="color: #93a1a1;"> }</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">template &lt;typename R, typename T, typename P&gt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">Callback&lt;R(P)&gt; Bind(R (T::*functor)(P), T* t) {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  return Callback&lt;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">      typename BindState&lt;RunnableAdapter&lt;R (T::*)(P)&gt;, R(P), R(T*)&gt;::UnboundType&gt;(</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">      new BindState&lt;RunnableAdapter&lt;R (T::*)(P)&gt;, R(P), R(T*)&gt;(</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">          RunnableAdapter&lt;R (T::*)(P)&gt;(functor), t));</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> bool called;</span>

<span style="color: #93a1a1;"> void void_func() {</span>
<span style="color: #586e75; background-color: #fdf6e3;">@@ -175,6 +204,13 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> struct Obj {</span>
<span style="color: #93a1a1;">   bool called;</span>
<span style="color: #93a1a1;"> };</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">struct Foo {</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  Foo() : called(false) {}</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  ~Foo() { assert(called); }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  void int_func(int) { called = true; }</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  bool called;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">};</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span>
<span style="color: #93a1a1;"> int main(int, char* []) {</span>
<span style="color: #93a1a1;">   called = false;</span>
<span style="color: #93a1a1;">   Callback&lt;void()&gt; cb = Bind(&amp;void_func);</span>
<span style="color: #586e75; background-color: #fdf6e3;">@@ -190,5 +226,8 @@</span><span style="color: #586e75; background-color: #fdf6e3;"> int main(int, char* []) {</span>
<span style="color: #93a1a1;">   Callback&lt;void()&gt; cb3 = Bind(&amp;Obj::void_func, &amp;o);</span>
<span style="color: #93a1a1;">   cb3.Run();</span>

<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  Foo foo;</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  Callback&lt;void(int)&gt; cb4 = Bind(&amp;Foo::int_func, &amp;foo);</span>
<span style="color: #859900; background-color: #eee8d5; font-weight: bold;">+</span><span style="color: #859900; background-color: #eee8d5; font-weight: bold;">  cb4.Run(1);</span>
<span style="color: #93a1a1;">   return 0;</span>
<span style="color: #93a1a1;"> }</span>
</pre>
</div>
</div>
</div>
